# ~/.Brewfile
# =============================================================================
# Project dependencies installed using `brew bundle`
#
# See https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "oven-sh/bun"
tap "ankitpokhrel/jira-cli"

cask_args appdir: "~/Applications"

brew "aider"
brew "age"
brew "antidote"
brew "asdf"
brew "awscli"
brew "btop"
brew "bun"
brew "chezmoi"
brew "colima"
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "go"
brew "gofumpt"
brew "golangci-lint"
brew "gomodifytags"
brew "gopls"
brew "gotests"
brew "htop"
brew "hunspell"
brew "iftop"
brew "jira-cli"
brew "jq"
brew "lazygit"
brew "mackup"
brew "mas"
brew "node"
brew "openapi-generator"
brew "openssh"
brew "pkg-config"
brew "powerlevel10k"
brew "pre-commit"
brew "python@3.12"
brew "rclone"
brew "ripgrep"
brew "ripgrep-all"
brew "sqlite"
brew "staticcheck"
brew "swift-format"
brew "swiftformat"
brew "swiftlint"
brew "sysbench"
brew "tmux"
brew "tree"
brew "unzip"
brew "vhs"
brew "wget"
brew "yara"
brew "zoxide"

cask "1password", args: { appdir: "/Applications" }
cask "1password-cli"
cask "alfred"
cask "appcleaner"
cask "balenaetcher"
cask "blender"
cask "bruno"
cask "chatgpt"
cask "cleanshot"
cask "db-browser-for-sqlite"
cask "discord"
cask "figma"
cask "firefox"
cask "fork"
cask "gifox"
cask "google-chrome"
cask "home-assistant"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "librewolf"
cask "notion"
cask "obsidian"
cask "rectangle"
cask "session-manager-plugin"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-text"
# tailscale cask is currently outdated
# cask "tailscale"
cask "telegram"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "warp"

vscode "4ops.packer"
vscode "adamhartford.vscode-base64"
vscode "adpyke.vscode-sql-formatter"
vscode "bazelbuild.vscode-bazel"
vscode "bbenoist.nix"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "cezaraugusto.vscode-chrome-extesion-manifest-json-schema"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "idleberg.applescript"
vscode "jnoortheen.nix-ide"
vscode "keesschollaart.vscode-home-assistant"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "marclipovsky.string-manipulation"
vscode "matthewpi.caddyfile-support"
vscode "mindaro-dev.file-downloader"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "oven.bun-vscode"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "timonwong.shellcheck"
vscode "vadimcn.vscode-lldb"
vscode "vknabel.vscode-swiftformat"
vscode "xaver.clang-format"
vscode "zxh404.vscode-proto3"
